simpleblog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "The Way"], ["body", "This is the way"], ["created_at", "2020-08-01 17:41:15.282979"], ["updated_at", "2020-08-01 17:41:15.282979"]]
---
    def create
        #render plain: params[:post].inspect
        @post = Post.new(post_params)

       if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "This is the waey"], ["updated_at", "2020-08-01 18:28:14.846346"], ["id", 1]]
---
    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)